
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2023.2.307
# Date: 2024-05-04 15:47

# Copyright (C) 2013 - 2023 Efinix Inc. All rights reserved.

# Device: T120F324
# Project: round_robin_ARB
# Timing Model: C4 (final)

# PLL Constraints
################
 create_clock -period 1.8750 Ddr_Clk
# create_clock -period 2.0000 Ddr_Clk

# create_clock -period 14.289 clk
create_clock -period 10.000 clk

# GPIO Constraints
####################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {rst}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {rst}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {div_out}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {div_out}]

# JTAG Constraints
####################
# create_clock -period <USER_PERIOD> [get_ports {jtag_inst1_TCK}]
set_output_delay -clock jtag_inst1_TCK -max 0.111 [get_ports {jtag_inst1_TDO}]
set_output_delay -clock jtag_inst1_TCK -min -0.053 [get_ports {jtag_inst1_TDO}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.231 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.116 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.321 [get_ports {jtag_inst1_SHIFT}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.161 [get_ports {jtag_inst1_SHIFT}]
# JTAG Constraints (extra... not used by current Efinity debug tools)
# create_clock -period <USER_PERIOD> [get_ports {jtag_inst1_DRCK}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_RUNTEST}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_RUNTEST}]
# Create separate clock groups for JTAG clocks. Remove DRCK clock from the list below if it is not defined.
# set_clock_groups -asynchronous -group {jtag_inst1_TCK jtag_inst1_DRCK}

# DDR Constraints
#####################
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 2.500 [get_ports {aaddr[*]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min -0.400 [get_ports {aaddr[*]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 2.500 [get_ports {aburst[1] aburst[0]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min -0.400 [get_ports {aburst[1] aburst[0]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 2.500 [get_ports {aid[*]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min -0.400 [get_ports {aid[*]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 2.500 [get_ports {alen[*]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min -0.400 [get_ports {alen[*]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 2.500 [get_ports {alock[1] alock[0]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min -0.400 [get_ports {alock[1] alock[0]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 2.500 [get_ports {asize[2] asize[1] asize[0]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min -0.400 [get_ports {asize[2] asize[1] asize[0]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 2.500 [get_ports {atype}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min -0.400 [get_ports {atype}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 2.500 [get_ports {avalid}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min -0.400 [get_ports {avalid}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 2.500 [get_ports {bready}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min -0.400 [get_ports {bready}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 2.500 [get_ports {rready}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min -0.400 [get_ports {rready}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 2.500 [get_ports {wdata[*]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min -0.400 [get_ports {wdata[*]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 2.500 [get_ports {wid[*]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min -0.400 [get_ports {wid[*]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 2.500 [get_ports {wlast}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min -0.400 [get_ports {wlast}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 2.500 [get_ports {wstrb[*]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min -0.400 [get_ports {wstrb[*]}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 2.500 [get_ports {wvalid}]
set_output_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min -0.400 [get_ports {wvalid}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 3.000 [get_ports {aready}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min 1.500 [get_ports {aready}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 3.000 [get_ports {bid[*]}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min 1.500 [get_ports {bid[*]}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 3.000 [get_ports {bvalid}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min 1.500 [get_ports {bvalid}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 3.000 [get_ports {rdata[*]}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min 1.500 [get_ports {rdata[*]}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 3.000 [get_ports {rid[*]}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min 1.500 [get_ports {rid[*]}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 3.000 [get_ports {rlast}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min 1.500 [get_ports {rlast}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 3.000 [get_ports {rresp[1] rresp[0]}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min 1.500 [get_ports {rresp[1] rresp[0]}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 3.000 [get_ports {rvalid}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min 1.500 [get_ports {rvalid}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -max 3.000 [get_ports {wready}]
set_input_delay -clock clk -reference_pin [get_ports {clk~CLKOUT~337~166}] -min 1.500 [get_ports {wready}]

# Clock Latency Constraints
############################
# set_clock_latency -source -setup <board_max + 1.476> [get_ports {Ddr_Clk}]
# set_clock_latency -source -hold <board_min + 0.738> [get_ports {Ddr_Clk}]
# set_clock_latency -source -setup <board_max + 1.476> [get_ports {clk}]
# set_clock_latency -source -hold <board_min + 0.738> [get_ports {clk}]
